{"items":[{"id":0,"name":"empty"},{"id":1,"name":"blink","localized_name":"Blink Dagger","description":"<h1>Active: Blink</h1> Teleport to a target point up to 1200 units away. <br><br>Blink Dagger cannot be used for 3 seconds after taking damage from an enemy hero or Roshan.","notes":"Self-casting will cause you to teleport in the direction of your team's fountain.<br />If you used Blink to teleport to a distance over the maximum range, you'll be teleported 4/5 of the maximum range instead.","lore":"The fabled dagger used by the fastest assassin ever to walk the lands."},{"id":2,"name":"blades_of_attack","localized_name":"Blades of Attack","lore":"The damage of these small, concealable blades should not be underestimated."},{"id":3,"name":"broadsword","localized_name":"Broadsword","lore":"The classic weapon of choice for knights, this blade is sturdy and reliable for slaying enemies."},{"id":4,"name":"chainmail","localized_name":"Chainmail","lore":"A medium weave of metal chains."},{"id":5,"name":"claymore","localized_name":"Claymore","lore":"A sword that can cut through armor, it's a commonly chosen first weapon for budding swordsmen."},{"id":6,"name":"helm_of_iron_will","localized_name":"Helm of Iron Will","lore":"The helmet of a legendary warrior who fell in battle."},{"id":7,"name":"javelin","localized_name":"Javelin","description":"<h1>Passive: Pierce</h1>Grants each attack a 25% chance to pierce through evasion and deal 100 bonus magical damage.","lore":"A rather typical spear that can sometimes pierce through an enemy's armor when used to attack."},{"id":8,"name":"mithril_hammer","localized_name":"Mithril Hammer","lore":"A hammer forged of pure mithril."},{"id":9,"name":"platemail","localized_name":"Platemail","lore":"Thick metal plates that protect the entire upper body. Avoid dropping on feet."},{"id":10,"name":"quarterstaff","localized_name":"Quarterstaff","lore":"A basic staff that allows you to strike quickly."},{"id":11,"name":"quelling_blade","localized_name":"Quelling Blade","description":"<h1>Active: Chop Tree/Ward</h1> Destroy a target tree or ward. Chop cast range is increased when targeting wards.<br><br>Tree Range: 350<BR>Ward Range: 450<br />\r\n<h1>Passive: Quell</h1> Increases attack damage against non-hero units by 24 for melee heroes, and 7 for ranged.","notes":"Effects of multiple quelling blades do not stack.<br />Chop can be used to destroy Techies' Remote Mines.","lore":"The axe of a fallen gnome, it allows you to effectively maneuver the forest."},{"id":12,"name":"ring_of_protection","localized_name":"Ring of Protection","lore":"A glimmering ring that defends its bearer."},{"id":182,"name":"stout_shield","localized_name":"Stout Shield","description":"<h1>Passive: Damage Block</h1>Grants a 50% chance to block 20 damage from incoming attacks on melee heroes, and 9 damage on ranged.","notes":"Multiple sources of damage block do not stack.","lore":"One man's wine barrel bottom is another man's shield."},{"id":13,"name":"gauntlets","localized_name":"Gauntlets of Strength","lore":"Studded leather gloves that add brute strength."},{"id":14,"name":"slippers","localized_name":"Slippers of Agility","lore":"Light boots made from spider skin that tingles your senses."},{"id":15,"name":"mantle","localized_name":"Mantle of Intelligence","lore":"A beautiful sapphire mantle worn by generations of queens."},{"id":16,"name":"branches","localized_name":"Iron Branch","description":"<h1>Use: Plant Tree</h1> Targets the ground to plant a happy little tree that lasts for 20 seconds.<br><br>Range: 400","lore":"A seemingly ordinary branch, its ironlike qualities are bestowed upon the bearer."},{"id":17,"name":"belt_of_strength","localized_name":"Belt of Strength","lore":"A valued accessory for improving vitality."},{"id":18,"name":"boots_of_elves","localized_name":"Band of Elvenskin","lore":"A tensile fabric often used for its light weight and ease of movement."},{"id":19,"name":"robe","localized_name":"Robe of the Magi","lore":"This robe corrupts the soul of the user, but provides wisdom in return."},{"id":20,"name":"circlet","localized_name":"Circlet","lore":"An elegant circlet designed for human princesses."},{"id":21,"name":"ogre_axe","localized_name":"Ogre Axe","lore":"You grow stronger just by holding it."},{"id":22,"name":"blade_of_alacrity","localized_name":"Blade of Alacrity","lore":"A long blade imbued with time magic."},{"id":23,"name":"staff_of_wizardry","localized_name":"Staff of Wizardry","lore":"A staff of magical powers passed down from the eldest mages."},{"id":24,"name":"ultimate_orb","localized_name":"Ultimate Orb","lore":"A mystical orb containing the essence of life."},{"id":25,"name":"gloves","localized_name":"Gloves of Haste","lore":"A pair of magical gloves that seems to render weapons weightless."},{"id":26,"name":"lifesteal","localized_name":"Morbid Mask","description":"<h1>Passive: Lifesteal</h1>Heals the attacker for 15% of attack damage dealt.","lore":"A mask that drains the energy of those caught in its gaze."},{"id":27,"name":"ring_of_regen","localized_name":"Ring of Regen","notes":"Ring of Regen is shareable.","lore":"This ring is considered a good luck charm among the Gnomes."},{"id":28,"name":"sobi_mask","localized_name":"Sage's Mask","notes":"Sage's Mask is shareable.","lore":"A mask commonly used by mages and warlocks for various rituals."},{"id":29,"name":"boots","localized_name":"Boots of Speed","description":"Movement speed bonuses from multiple pairs of boots do not stack.","lore":"Fleet footwear, increasing movement."},{"id":30,"name":"gem","localized_name":"Gem of True Sight","description":"<h1>Passive: True Sight</h1> Grants the ability to see invisible units and wards to any allied vision within 900 range of its carrier. <br />\r\n<h1>Passive: Everlasting</h1><font color='#e03e2e'>Dropped on death, and cannot be destroyed.</font>","notes":"Disabled while on a courier.","lore":"Not one thrall creature of the depths,\r\nNor spirit bound in drowning's keep,\r\nNor Maelrawn the Tentacular,\r\nShall rest till seas, gem comes to sleep."},{"id":31,"name":"cloak","localized_name":"Cloak","notes":"Stacks multiplicatively with other sources of spell resistance.","lore":"A cloak made of a magical material that works to dispel any magic cast on it."},{"id":32,"name":"talisman_of_evasion","localized_name":"Talisman of Evasion","notes":"Stacks diminishingly with other sources of Evasion.","lore":"A necklace that allows you to anticipate enemy attacks."},{"id":33,"name":"cheese"},{"id":34,"name":"magic_stick","localized_name":"Magic Stick","description":"<h1>Active: Energy Charge</h1> Instantly restores 15 health and mana per charge stored.<br><br> Max 10 charges. Gains a charge whenever a visible enemy within 1200 range uses an ability.","notes":"Gains charges for spells cast by visible enemies in 1200 range.<br />Certain abilities and item abilities will not add charges.","lore":"A simple wand used to channel magic energies, it is favored by apprentice wizards and great warlocks alike."},{"id":35,"name":"recipe_magic_wand"},{"id":36,"name":"magic_wand","localized_name":"Magic Wand","description":"<h1>Active: Energy Charge</h1>Instantly restores 15 health and mana per charge stored. <br><br>Max 20 charges. Gains a charge whenever a visible enemy within 1200 range uses an ability.","notes":"Gains charges for spells cast by visible enemies in 1200 range.<br />Certain abilities and item abilities will not add charges.","lore":"A simple wand used to channel magic energies, it is favored by apprentice wizards and great warlocks alike."},{"id":37,"name":"ghost","localized_name":"Ghost Scepter","description":"<h1>Active: Ghost Form</h1> You enter ghost form for 4 seconds, becoming immune to physical damage, but are unable to attack and 40% more vulnerable to magic damage.","notes":"Ends if you become Spell Immune, and will have no effect if you are already Spell Immune.<br />Shares cooldown with Ethereal Blade.","lore":"Imbues the wielder with a ghostly presence, allowing them to evade physical damage."},{"id":38,"name":"clarity","localized_name":"Clarity","description":"<h1>Use: Replenish</h1> Grants 4.5 mana regeneration to the target for 50 seconds.<br><br>If the unit is attacked by an enemy hero or Roshan, the effect is lost.<br><br>Range: 250","lore":"Clear water that enhances the ability to meditate."},{"id":39,"name":"flask","localized_name":"Healing Salve","description":"<h1>Use: Salve</h1> Grants 50 health regeneration to the target for 8 seconds.<br><br>If the unit is attacked by an enemy hero or Roshan, the effect is lost.<br><br>Range: 250","lore":"A magical salve that can quickly mend even the deepest of wounds."},{"id":40,"name":"dust","localized_name":"Dust of Appearance","description":"<h1>Use: Reveal</h1>Reveals and slows invisible heroes by 20% in a 1050 radius around the caster for 12 seconds.","notes":"Places a debuff on enemy units in the area that reveals them when they are invisible.","lore":"One may hide visage, but never volume."},{"id":41,"name":"bottle","localized_name":"Bottle","description":"<h1>Active: Regenerate</h1>Consumes a charge to restore 125 health and 75 mana over 2.5 seconds. If the hero is attacked by an enemy hero or Roshan, the effect is lost.<br><br>The Bottle automatically refills at the fountain.<br><br>Hold Control to use on an allied hero.<br><br>Range: 350<br />\r\n<h1>Passive:  Store Rune</h1>Runes can be stored in the bottle for later use by right-clicking them. Unused runes will automatically activate after 2 minutes.<br><br>Using a stored rune fully refills the Bottle.","notes":"Bottle is shareable. Stored runes cannot be shared.<br />If Bottle does not have full charges and is placed on a courier, the courier's movespeed will be slowed by 30%.","lore":"An old bottle that survived the ages, the contents placed inside become enchanted."},{"id":42,"name":"ward_observer","localized_name":"Observer Ward","description":"<h1>Use: Plant</h1>Plants an Observer Ward, an invisible watcher that gives ground vision in a 1600 radius to your team. Lasts 6 minutes.<br><br>Hold Control to give one Observer Ward to an allied hero.<br><br>Range: 500","lore":"A form of half-sentient plant, often cultivated by apprentice wizards."},{"id":43,"name":"ward_sentry","localized_name":"Sentry Ward","description":"<h1>Use: Plant</h1> Plants a Sentry Ward, an invisible watcher that grants True Sight, the ability to see invisible enemy units and wards, to any existing allied vision within a 1000 radius.<br>Lasts 6 minutes.<br><br>Does not grant ground vision.<br>Hold Control to give one Sentry Ward to an allied hero.<br><br>Range: 500","lore":"A form of plant originally grown in the garden of a fearful king."},{"id":44,"name":"tango","localized_name":"Tango","description":"<h1>Use: Devour</h1> Consumes a target tree to gain 7 health regeneration for 16 seconds. Consuming a ward or Ironwood Tree doubles the heal amount.<br><br>Comes with 3 charges.  Can be used on an allied hero to give them one Tango.<br><br>Range: 165<br>Ward Range: 450","lore":"Forage to survive on the battlefield."},{"id":45,"name":"courier","localized_name":"Animal Courier","description":"<h1>Use: Deploy Courier</h1> Deploys a creature to carry items to and from your team's base.","lore":"Losing the courier is punishable by death."},{"id":46,"name":"tpscroll","localized_name":"Town Portal Scroll","description":"<h1>Use: Teleport</h1>After channeling for 3 seconds, teleports you to a target friendly building. <br><br>Double-click to teleport to your team's base fountain.","notes":"If multiple heroes teleport to the same location in succession, the channeling time will be increased for each successive hero.<br />Teleport can be prevented or canceled by Root abilities.","lore":"What a hero truly needs."},{"id":47,"name":"recipe_travel_boots"},{"id":48,"name":"travel_boots","localized_name":"Boots of Travel","description":"<h1>Active: Teleport</h1> Teleports you to an allied non-hero unit or structure. Teleporting to a unit is interrupted if the target unit dies.<br><br>Adds 10 seconds to the cooldown of Town Portal Scroll.<br />\r\nMovement speed bonuses from multiple pairs of boots do not stack.","lore":"Winged boots that grant omnipresence."},{"id":49,"name":"recipe_phase_boots"},{"id":50,"name":"phase_boots","localized_name":"Phase Boots","description":"<h1>Active: Phase</h1> Gives 22% increased movement speed on melee heroes, and 10% on ranged heroes, and lets you move through units and turn more quickly for 3 seconds.<br />\r\nMovement speed bonuses from multiple pairs of boots do not stack.","lore":"Boots that allow the wearer to travel between the ether."},{"id":51,"name":"demon_edge","localized_name":"Demon Edge","lore":"One of the oldest weapons forged by the Demon-Smith Abzidian, it killed its maker when he tested its edge."},{"id":52,"name":"eagle","localized_name":"Eaglesong","lore":"Capturing the majestic call of an eagle, this mystical horn brings limitless dexterity to those who hear it."},{"id":53,"name":"reaver","localized_name":"Reaver","lore":"A massive axe capable of tearing whole mountains down."},{"id":54,"name":"relic","localized_name":"Sacred Relic","lore":"An ancient weapon that often turns the tides of war."},{"id":55,"name":"hyperstone","localized_name":"Hyperstone","lore":"A mystical, carved stone that boosts the fervor of the holder."},{"id":56,"name":"ring_of_health","localized_name":"Ring of Health","notes":"Ring of Health is shareable.","lore":"A shiny ring found beneath a fat halfling's corpse."},{"id":57,"name":"void_stone","localized_name":"Void Stone","notes":"Void Stone is shareable.","lore":"Jewelry that was once used to channel nether realm magic, this ring pulses with energy."},{"id":58,"name":"mystic_staff","localized_name":"Mystic Staff","lore":"Enigmatic staff made of only the most expensive crystals."},{"id":59,"name":"energy_booster","localized_name":"Energy Booster","lore":"This lapis gemstone is commonly added to the collection of wizards seeking to improve their presence in combat."},{"id":60,"name":"point_booster","localized_name":"Point Booster","lore":"A perfectly formed amethyst that nourishes body and mind when held."},{"id":61,"name":"vitality_booster","localized_name":"Vitality Booster","lore":"A ruby gemstone that has been passed down through generations of warrior kin."},{"id":62,"name":"recipe_power_treads"},{"id":63,"name":"power_treads","localized_name":"Power Treads","description":"<h1>Active: Switch Attribute</h1>Switches between +10 Strength, +10 Agility, or +10 Intelligence.<br />\r\nMovement speed bonuses from multiple pairs of boots do not stack.","notes":"Power Treads can be built using a Belt of Strength, Band of Elvenskin, or a Robe of the Magi.","lore":"A pair of tough-skinned boots that change to meet the demands of the wearer."},{"id":64,"name":"recipe_hand_of_midas"},{"id":65,"name":"hand_of_midas","localized_name":"Hand of Midas","description":"<h1>Active: Transmute</h1> Kills a non-hero target for 160 gold and 1.85x experience. <br><br> Cannot be used on Ancient Creeps.<br><br>Range: 600","notes":"The gold given is reliable gold (you do not get the normal creep bounty).<br />Experience gained by using Transmute is not shared.","lore":"Preserved through unknown magical means, the Hand of Midas is a weapon of greed, sacrificing animals to line the owner's pockets."},{"id":66,"name":"recipe_oblivion_staff"},{"id":67,"name":"oblivion_staff","localized_name":"Oblivion Staff","lore":"Deceptively hidden as an ordinary quarterstaff, it is actually very powerful, much like the Eldritch who originally possessed it."},{"id":68,"name":"recipe_pers"},{"id":69,"name":"pers","localized_name":"Perseverance","notes":"Perseverance is shareable.","lore":"A gem that grants heart to the bearer."},{"id":70,"name":"recipe_poor_mans_shield"},{"id":71,"name":"poor_mans_shield"},{"id":72,"name":"recipe_bracer"},{"id":73,"name":"bracer","localized_name":"Bracer","lore":"The bracer is a common choice to toughen up defenses and increase longevity."},{"id":74,"name":"recipe_wraith_band"},{"id":75,"name":"wraith_band","localized_name":"Wraith Band","lore":"A circlet with faint whispers echoing about it."},{"id":76,"name":"recipe_null_talisman"},{"id":77,"name":"null_talisman","localized_name":"Null Talisman","lore":"A small gemstone attached to several chains."},{"id":78,"name":"recipe_mekansm"},{"id":79,"name":"mekansm","localized_name":"Mekansm","description":"<h1>Active: Restore</h1>Heals 275 health and gives +2 armor to allied units in a 1200 radius.<br />\r\n<h1>Passive: Mekansm Aura</h1>Grants 3.5 health regeneration to allied units in a 1200 radius.","notes":"Restore does not affect units that have been affected by Restore in the last 25 seconds.<br />Multiple instances of Mekansm Aura do not stack.","lore":"A glowing jewel formed out of assorted parts that somehow fit together perfectly."},{"id":80,"name":"recipe_vladmir"},{"id":81,"name":"vladmir","localized_name":"Vladmir's Offering","description":"<h1>Passive: Vladmir's Aura</h1>Grants lifesteal (15% for melee heroes, 10% for ranged), 1.5 mana regeneration, 15% bonus attack damage, and 4 armor to nearby allies. <br><br>Radius: 1200","notes":"Multiple instances of Vladmir's Aura do not stack.","lore":"An eerie mask that is haunted with the malice of a fallen vampire."},{"id":84,"name":"flying_courier"},{"id":85,"name":"recipe_buckler"},{"id":86,"name":"buckler","localized_name":"Buckler","description":"<h1>Active: Armor Bonus</h1> Gives +2 armor to all allied units.  Lasts 15 seconds on heroes, 30 seconds on units.<br><br>Radius: 1200","lore":"A powerful shield that imbues the bearer with the strength of heroes past, it is capable of protecting entire armies in battle."},{"id":87,"name":"recipe_ring_of_basilius"},{"id":88,"name":"ring_of_basilius","localized_name":"Ring of Basilius","description":"<h1>Passive: Basilius Aura</h1>Grants 0.75 mana regeneration and 2 armor in a 1200 radius.<br />\r\n<h1>Toggle: Aura</h1>Deactivate aura to stop affecting non-hero units.","notes":"Multiple instances of Basilius Aura do not stack.","lore":"Ring given as a reward to the greatest mages."},{"id":89,"name":"recipe_pipe"},{"id":90,"name":"pipe","localized_name":"Pipe of Insight","description":"<h1>Active: Barrier</h1>Gives a shield that blocks 400 magic damage to all nearby allies. Lasts 12 seconds.<br><br>Radius: 1200<br />\r\n<h1>Passive: Insight Aura</h1> Gives allied units 2 health regeneration and 10% magic resistance.<br><br>Radius: 1200","notes":"Multiple instances of Barrier do not stack.<br />Stacks multiplicatively with other sources of magic resistance.","lore":"A powerful artifact of mysterious origin, it creates barriers against magical forces."},{"id":91,"name":"recipe_urn_of_shadows"},{"id":92,"name":"urn_of_shadows","localized_name":"Urn of Shadows","description":"<h1>Active: Soul Release</h1> Provides 30 health regeneration when cast on allies, and deals 25 damage per second when cast on enemies. <br><br>Lasts 8 seconds.  <br><br>Gains charges every time an enemy hero dies within 1400 units.  Only the closest Urn to the dying hero will gain a charge.<br><br>Cast Range: 950","notes":"Empty urns gain 2 charges.<br />If used on a hero with Soul Release already active on them, it will refresh its duration.","lore":"Contains the ashes of powerful demons."},{"id":93,"name":"recipe_headdress"},{"id":94,"name":"headdress","localized_name":"Headdress","description":"<h1>Passive: Regeneration Aura</h1>Grants 2 health regeneration to allies.<br><br>Radius: 1200","notes":"Multiple instances of Regeneration Aura do not stack.","lore":"Creates a soothing aura that restores allies in battle."},{"id":95,"name":"recipe_sheepstick"},{"id":96,"name":"sheepstick","localized_name":"Scythe of Vyse","description":"<h1>Active: Hex</h1>Turns a target unit into a harmless critter for 3.5 seconds. The target has a base movement speed of 140 and will be silenced, muted, and disarmed.<br>Instantly destroys illusions.<br><br>Range: 800","notes":"The target will have a base movement speed of 140, but buffs granting maximum movement speed won't be disabled.","lore":"The most guarded relic among the cult of Vyse, it is the most coveted weapon among magi."},{"id":97,"name":"recipe_orchid"},{"id":98,"name":"orchid","localized_name":"Orchid Malevolence","description":"<h1>Active: Soul Burn</h1>Silences the target unit for 5 seconds. At the end of the silence, 30% of the damage received while silenced is inflicted as bonus magical damage.<br><br>Range: 900","lore":"A garnet rod constructed from the essence of a fire demon."},{"id":99,"name":"recipe_cyclone"},{"id":100,"name":"cyclone","localized_name":"Eul's Scepter of Divinity","description":"<h1>Active: Cyclone</h1> Sweeps a target unit up into a cyclone, making them invulnerable for 2.5 seconds. Cyclone can only be cast on enemy units or yourself.<br><br>Enemy units take 50 magical damage upon landing.<br><br>Range: 575<br>Dispel Type: <span class=\"GameplayValues GameplayVariable\">Basic Dispel</span>","notes":"You cannot cyclone allies.<br />Cyclones cast on yourself go through spell immunity.<br />Cyclone can purge some buffs and debuffs.","lore":"A mysterious scepter passed down through the ages, its disruptive winds can be used for good or evil."},{"id":101,"name":"recipe_force_staff"},{"id":102,"name":"force_staff","localized_name":"Force Staff","description":"<h1>Active: Force</h1>Pushes any target unit 600 units in the direction it is facing.<br><br>Range: 750","notes":"Self-cast will cause you to use Force on yourself.<br />Force Staff doesn't interrupt the target's actions.<br />Will not work on a unit inside Chronosphere, Duel, or Black Hole.","lore":"Allows you to manipulate others, for good or evil."},{"id":103,"name":"recipe_dagon"},{"id":197,"name":"recipe_dagon_2"},{"id":198,"name":"recipe_dagon_3"},{"id":199,"name":"recipe_dagon_4"},{"id":200,"name":"recipe_dagon_5"},{"id":104,"name":"dagon","localized_name":"Dagon","description":"<h1>Active: Energy Burst</h1> Emits a powerful burst of magical damage upon a targeted enemy unit. Upgradable.<br><br>Damage: 400<br>Range: 600<br>Mana Cost: 120","notes":"Instantly kills illusions.","lore":"A lesser wand that grows in power the longer it is used, it brings magic to the fingertips of the user."},{"id":201,"name":"dagon_2"},{"id":202,"name":"dagon_3"},{"id":203,"name":"dagon_4"},{"id":204,"name":"dagon_5"},{"id":105,"name":"recipe_necronomicon"},{"id":191,"name":"recipe_necronomicon_2"},{"id":192,"name":"recipe_necronomicon_3"},{"id":106,"name":"necronomicon","localized_name":"Necronomicon","description":"<h1>Active: Demonic Summoning</h1>Summons a Warrior and an Archer to fight for you for 60 seconds.<br><br><h1>Warrior:</h1>Burns mana every hit, and deals magical damage to whoever kills it.  Gains True Sight at level 3.<br>Health: 700<br>Damage: 75<br>Mana Break Damage: 30<br>Last Will Damage: 600<br><br><h1>Archer:</h1>Has a passive movement and attack speed aura. Gains Purge at Level 3.<br>Health: 700<br>Damage: 60<br>Aura Move Speed: 5<br>Aura Attack Speed: 5<br>Aura Radius: 1200","lore":"Considered the ultimate in necromancy and demonology, a powerful malefic force is locked within its pages."},{"id":193,"name":"necronomicon_2"},{"id":194,"name":"necronomicon_3"},{"id":107,"name":"recipe_ultimate_scepter"},{"id":108,"name":"ultimate_scepter","localized_name":"Aghanim's Scepter","description":"<h1>Passive: Ultimate Upgrade</h1>Upgrades the ultimate, and some abilities, of certain heroes.","lore":"The scepter of a wizard with demigod-like powers."},{"id":109,"name":"recipe_refresher"},{"id":110,"name":"refresher","localized_name":"Refresher Orb","description":"<h1>Active: Reset Cooldowns</h1>Resets the cooldowns of all your items and abilities.","lore":"A powerful artifact created for wizards."},{"id":111,"name":"recipe_assault"},{"id":112,"name":"assault","localized_name":"Assault Cuirass","description":"<h1>Passive: Assault Aura</h1> Grants 25 attack speed and 5 armor to nearby allied units and structures, and decreases nearby enemy unit and structure armor by 5.<br><br>Radius: 1200","notes":"Multiple instances of Assault Aura do not stack.","lore":"Forged in the depths of the nether reaches, this hellish mail provides an army with increased armor and attack speed."},{"id":113,"name":"recipe_heart"},{"id":114,"name":"heart","localized_name":"Heart of Tarrasque","description":"<h1>Passive: Health Regeneration</h1>Restores 5% of max health per second. <br><br>If damage is taken from an enemy hero or Roshan, this ability is disabled for 5 seconds for melee heroes, or 7 seconds for ranged heroes.","lore":"Preserved heart of an extinct monster, it bolsters the bearer's fortitude."},{"id":115,"name":"recipe_black_king_bar"},{"id":116,"name":"black_king_bar","localized_name":"Black King Bar","description":"<h1>Active: Avatar</h1> Grants Spell Immunity and 100% Magic Damage Resistance.  Duration decreases with each use. <br><br>Duration: 10 <br>Dispel Type: <span class=\"GameplayValues GameplayVariable\">Basic Dispel</span>","notes":"Purchasing another Black King Bar will not reset its immunity duration.<br />Using Black King Bar may remove some positive buffs.","lore":"A powerful staff imbued with the strength of giants."},{"id":117,"name":"aegis"},{"id":118,"name":"recipe_shivas_guard"},{"id":119,"name":"shivas_guard","localized_name":"Shiva's Guard","description":"<h1>Active: Arctic Blast</h1> Emits a freezing wave that deals 200 magical damage to enemies and slows their movement by 40% for 4 seconds.<br><br>Radius: 900<br />\r\n<h1>Passive: Freezing Aura</h1> Reduces the attack speed of all enemies by 45. <br><br>Radius: 1200","notes":"The wave extends at a speed of 350 to a max size of 900.<br />The Arctic Blast follows its caster.<br />Multiple instances of Freezing Aura do not stack.","lore":"Said to have belonged to a goddess, today it retains much of its former power."},{"id":120,"name":"recipe_bloodstone"},{"id":121,"name":"bloodstone","localized_name":"Bloodstone","description":"<h1>Active: Bloodpact</h1> Converts 30% of your max mana to health regeneration over 2 seconds.<br />\r\n <h1>Passive: Mana Battery</h1>Each charge provides 0.3 HP and MP regen. Nearby kills provide 1 charges. Dying causes you to lose 3 charges. Starts with 14 charges.","lore":"The Bloodstone's bright ruby color is unmistakable on the battlefield, as the owner seems to have infinite vitality and spirit."},{"id":122,"name":"recipe_sphere"},{"id":123,"name":"sphere","localized_name":"Linken's Sphere","description":"<h1>Passive: Spellblock</h1>Blocks most targeted spells once every 13 seconds.<br />\r\n<h1>Active: Transfer Spellblock</h1>Temporarily removes Spellblock from the item's owner and transfers it to an allied unit for 13 seconds.<br><br>Range: 700","lore":"This magical sphere once protected one of the most famous heroes in history."},{"id":124,"name":"recipe_vanguard"},{"id":125,"name":"vanguard","localized_name":"Vanguard","description":"<h1>Passive: Damage Block</h1> Grants a 50% chance to block 70 damage from incoming attacks on melee heroes, and 35 damage on ranged.","notes":"Multiple sources of damage block do not stack.","lore":"A powerful shield that defends its wielder from even the most vicious of attacks."},{"id":126,"name":"recipe_blade_mail"},{"id":127,"name":"blade_mail","localized_name":"Blade Mail","description":"<h1>Active: Damage Return</h1>For 4.5 seconds, duplicates any damage taken back to the unit that dealt the damage.","notes":"Damage Return is calculated before any kind of reduction.<br />Damage Return doesn't reflect damage from other forms of Blade Mail.<br />Returned damage type is the same as it was received.<br />Can pierce Spell Immunity if the original damage type does.","lore":"A razor-sharp coat of mail, it is the choice of selfless martyrs in combat."},{"id":128,"name":"recipe_soul_booster"},{"id":129,"name":"soul_booster","localized_name":"Soul Booster","lore":"Regain lost courage."},{"id":130,"name":"recipe_hood_of_defiance"},{"id":131,"name":"hood_of_defiance","localized_name":"Hood of Defiance","description":"<h1>Active: Barrier</h1> Creates a spell shield that absorbs up to 325 magical damage.  Lasts 12 seconds.","notes":"Stacks multiplicatively with other sources of spell resistance.","lore":"A furred, magic resistant headpiece that is feared by wizards."},{"id":132,"name":"recipe_rapier"},{"id":133,"name":"rapier","localized_name":"Divine Rapier","description":"<h1>Passive: Everlasting</h1> <font color='#e03e2e'>Dropped on death, and cannot be destroyed.</font> <br><br>Becomes unusable if picked up by an ally of its owner until it is returned to its owner. It is immediately usable by anybody if an enemy of the owner picks it up and is killed. A dropped Rapier cannot be picked up by a courier.","notes":"If Divine Rapier is dropped and picked up by an enemy of its original owner, it cannot be dropped again except by death.","lore":"So powerful, it cannot have a single owner."},{"id":134,"name":"recipe_monkey_king_bar"},{"id":135,"name":"monkey_king_bar","localized_name":"Monkey King Bar","description":"<h1>Passive: Pierce</h1>Grants each attack a 75% chance to pierce through evasion and deal 100 bonus magical damage.","lore":"A powerful staff used by a master warrior."},{"id":136,"name":"recipe_radiance"},{"id":137,"name":"radiance","localized_name":"Radiance","description":"<h1>Toggle: Burn</h1> When active, scorches enemies for 60 magical damage per second, and causes them to miss 17% of their attacks. Illusions deal 35 magical damage per second.<br><br>Radius: 700","lore":"A divine weapon that causes damage and a bright burning effect that lays waste to nearby enemies."},{"id":138,"name":"recipe_butterfly"},{"id":139,"name":"butterfly","localized_name":"Butterfly","notes":"Stacks diminishingly with other sources of Evasion.","lore":"Only the mightiest and most experienced of warriors can wield the Butterfly, but it provides incredible dexterity in combat."},{"id":140,"name":"recipe_greater_crit"},{"id":141,"name":"greater_crit","localized_name":"Daedalus","description":"<h1>Passive: Critical Strike</h1>Grants each attack a 30% chance to deal 235% damage.","notes":"Critical Strike does not work against buildings.","lore":"A weapon of incredible power that is difficult for even the strongest of warriors to control."},{"id":142,"name":"recipe_basher"},{"id":143,"name":"basher","localized_name":"Skull Basher","description":"<h1>Passive: Bash</h1> Grants melee heroes a 25% chance on hit to stun the target for 1.5 seconds and deal 100 bonus magical damage.  Bash chance for ranged heroes is 10%.","notes":"Does not stack with other sources of Bash, however it will stack with Mini-Bash.<br />The following heroes cannot trigger Bash on this item: Spirit Breaker, Faceless Void, and Slardar.","lore":"A feared weapon in the right hands, this maul's ability to shatter the defenses of its opponents should not be underestimated."},{"id":144,"name":"recipe_bfury"},{"id":145,"name":"bfury","localized_name":"Battle Fury","description":"<h1>Active: Chop Tree/Ward</h1> Destroy a target tree or ward.<br><br>Tree Cast Range: 350<br>Ward Cast Range: 450 <br />\r\n<h1>Passive: Quell</h1> Increases attack damage against non-hero units by 24 for melee heroes, and 7 for ranged. <br />\r\n<h1>Passive: Cleave</h1> Deals 60% of attack damage as physical damage in a cone up to 650 around the target. (Melee Only)","notes":"Cleave damage is reduced by armor type but not by armor value.<br />Cleave damage goes through spell immunity.<br />If multiple sources of Cleave are present, each Cleave's damage is applied separately.<br />Chop can be used to destroy Techies' Remote Mines.","lore":"The bearer of this mighty axe gains the ability to cut down swaths of enemies at once."},{"id":146,"name":"recipe_manta"},{"id":147,"name":"manta","localized_name":"Manta Style","description":"<h1>Active: Mirror Image</h1>Creates 2 images of your hero that last 20 seconds. <br><br>Melee images deal 33% damage and take 350% damage, while Ranged images deal 28% and take 400% damage. <br><br>Cooldown increased by 15 seconds on ranged heroes.<br><br>Dispel Type: <span class=\"GameplayValues GameplayVariable\">Basic Dispel</span>","notes":"Has a 0.1 second cast time during which you are invulnerable.<br />Many effects are removed upon using Manta.<br />Yasha based movement speed bonuses from multiple items do not stack.","lore":"An axe made of reflective materials that causes confusion amongst enemy ranks."},{"id":148,"name":"recipe_lesser_crit"},{"id":149,"name":"lesser_crit","localized_name":"Crystalys","description":"<h1>Passive: Critical Strike</h1>Grants each attack a 20% chance to deal 175% damage.","notes":"Critical Strike does not work against buildings.","lore":"A blade forged from rare crystals, it seeks weak points in enemy armor."},{"id":150,"name":"recipe_armlet"},{"id":151,"name":"armlet","localized_name":"Armlet of Mordiggian","description":"<h1>Toggle: Unholy Strength</h1>When active, Unholy Strength grants +31 damage, +25 strength and +4 armor, but drains 54 health per second.<br><br> You cannot die from the health drain when Unholy Strength is activated, nor from the strength loss when Unholy Strength is deactivated.","notes":"The strength change will affect both maximum and current HP, but you cannot die from the change.<br />The strength change occurs over 0.6 seconds.<br />Activating or deactivating Unholy Strength does not interrupt channeling.","lore":"Weapon of choice among brutes, the bearer sacrifices his life energy to gain immense strength and power."},{"id":183,"name":"recipe_invis_sword"},{"id":152,"name":"invis_sword","localized_name":"Shadow Blade","description":"<h1>Active: Shadow Walk</h1>Makes you invisible for 14 seconds, or until you attack or cast a spell.  While Shadow Walk is active, you move 20% faster and can move through units.  <br><br>If attacking to end the invisibility, you gain 175 bonus physical damage on that attack.","notes":"Has a 0.3 second fade time.<br />If the invisibility ends without attacking, the bonus damage is lost.","lore":"The blade of a fallen king, it allows you to move unseen and strike from the shadows."},{"id":153,"name":"recipe_sange_and_yasha"},{"id":154,"name":"sange_and_yasha","localized_name":"Sange and Yasha","notes":"Yasha-based movement speed bonuses from multiple items do not stack.","lore":"Sange and Yasha, when attuned by the moonlight and used together, become a very powerful combination."},{"id":155,"name":"recipe_satanic"},{"id":156,"name":"satanic","localized_name":"Satanic","description":"<h1>Active: Unholy Rage</h1>Increases Lifesteal percentage to 200% for 5 seconds. <br />\r\n<h1>Passive: Lifesteal</h1>Heals the attacker for 25% of attack damage dealt.","lore":"Immense power at the cost of your soul."},{"id":157,"name":"recipe_mjollnir"},{"id":158,"name":"mjollnir","localized_name":"Mjollnir","description":"<h1>Active: Static Charge</h1>Places a charged shield on a target unit for 15 seconds which has a 20% chance to release a 200 magical damage shocking bolt at a nearby attacker and 4 additional enemies.<br><br>Range: 800<br />\r\n<h1>Passive: Chain Lightning</h1>Grants a 25% chance on attack to release a bolt of electricity that leaps between 12 targets within a 900 radius, dealing 170 magical damage to each. Lightning proc pierces evasion.","notes":"Static Charge cannot trigger more than once per second.<br />Static Charge's shock deals magical damage centered on hero with the Static Charge. Static Charge's targets cannot be more than 900 range away.<br />Static Charge procs will not bounce to heroes that are invisible or hidden by Fog of War.","lore":"Thor's magical hammer, made for him by the dwarves Brok and Eitri."},{"id":159,"name":"recipe_skadi"},{"id":160,"name":"skadi","localized_name":"Eye of Skadi","description":"<h1>Passive: Cold Attack</h1> Attacks lower enemy attack speed by %cold_attack_speed% and movement speed by %cold_movement_speed%%. <br><br>Lasts %cold_duration_melee% seconds when used by melee heroes, and %cold_duration_ranged% seconds when used by ranged.","notes":"Lasts 5 seconds with melee Eye of Skadi, 2.5 seconds with ranged Eye of Skadi.","lore":"Extremely rare artifact, guarded by the azure dragons."},{"id":161,"name":"recipe_sange"},{"id":162,"name":"sange","localized_name":"Sange","lore":"Sange is an unusually accurate weapon, seeking weak points automatically."},{"id":163,"name":"recipe_helm_of_the_dominator"},{"id":164,"name":"helm_of_the_dominator","localized_name":"Helm of the Dominator","description":"<h1>Active: Dominate</h1>Takes control of one neutral, non-ancient target unit and sets its movement speed to 425 and max health to a minimum of 1500.<br><br>Dominated units with a max health of greater than 1500 retain their original max health.  Dominated unit's bounty is set to 200 gold.<br><br>Range: 700<br />\r\n<h1>Passive: Dominator Aura</h1> Increases nearby allies' attack speed by 20 and health regen by 8.5.<br><br>Radius: 1200","notes":"Cannot dominate more than one unit at a time.  If a new unit is dominated, the old one will die.<br />Can also Dominate enemy lane creeps and summoned units.<br />Selling Helm of the Dominator will cause dominated units to die.","lore":"The powerful headpiece of a dead necromancer."},{"id":165,"name":"recipe_maelstrom"},{"id":166,"name":"maelstrom","localized_name":"Maelstrom","description":"<h1>Passive: Chain Lightning</h1>Grants a 25% chance on attack to release a bolt of electricity that leaps between 4 targets within a 900 radius, dealing 160 magical damage to each. Lightning proc pierces evasion.","lore":"A hammer forged for the gods themselves, Maelstrom allows its user to harness the power of lightning."},{"id":167,"name":"recipe_desolator"},{"id":168,"name":"desolator","localized_name":"Desolator","description":"<h1>Passive: Corruption</h1> Your attacks reduce the target's armor by 7 for 15 seconds.","notes":"Armor reduction works on buildings.","lore":"A wicked weapon, used in torturing political criminals."},{"id":169,"name":"recipe_yasha"},{"id":170,"name":"yasha","localized_name":"Yasha","notes":"Yasha-based movement speed bonuses from multiple items do not stack.","lore":"Yasha is regarded as the swiftest weapon ever created."},{"id":171,"name":"recipe_mask_of_madness"},{"id":172,"name":"mask_of_madness","localized_name":"Mask of Madness","description":"<h1>Active: Berserk</h1>Gives 110 attack speed and 30 movement speed, but reduces your armor by 8 and silences you.  Lasts 8 seconds.<br />\r\n<h1>Passive: Lifesteal</h1>Heals the attacker for 20% of attack damage dealt.","lore":"Once this mask is worn, its bearer becomes an uncontrollable aggressive force."},{"id":173,"name":"recipe_diffusal_blade"},{"id":195,"name":"recipe_diffusal_blade_2"},{"id":174,"name":"diffusal_blade","localized_name":"Diffusal Blade","description":"<h1>Active: Inhibit</h1> Targets an enemy, slowing it for 4 seconds.<br><br>Range: 600<br />\r\n<h1>Passive: Manabreak</h1>Each attack burns 50 mana from the target, and deals 0.8 physical damage per burned mana. <br><br>Burns 16 mana per attack from melee illusions and 8 mana per attack from ranged illusions.","notes":"Does not stack with other manabreak abilities.","lore":"An enchanted blade that allows the user to cut straight into the enemy's soul."},{"id":196,"name":"diffusal_blade_2"},{"id":175,"name":"recipe_ethereal_blade"},{"id":176,"name":"ethereal_blade","localized_name":"Ethereal Blade","description":"<h1>Active: Ether Blast</h1>Converts the target unit to ethereal form, rendering them immune to physical damage, but unable to attack and 40% more vulnerable to magic damage.  Lasts for 4 seconds on allies and 4 seconds on enemies.<br><br>  Enemy targets are also slowed by 80%, and take 2x your primary attribute + 75 as magical damage.<br><br>Range: 800","notes":"Shares cooldown with Ghost Scepter.<br />Ethereal units take 40% bonus magic damage.<br />Lasts an extra second on Self or Allied cast.<br />Using a Town Portal Scroll or Boots of Travel will not dispel Ethereal Form.","lore":"A flickering blade of a ghastly nature, it is capable of dealing damage in both magical and physical planes."},{"id":177,"name":"recipe_soul_ring"},{"id":178,"name":"soul_ring","localized_name":"Soul Ring","description":"<h1>Active: Sacrifice</h1> Consume 170 health to temporarily gain 150 mana.  Lasts 10 seconds.<br><br>If the mana gained cannot fit in your mana pool, it creates a buffer of mana that will be used before your mana pool.","notes":"If this mana is not used before the duration ends, the extra mana is lost.","lore":"A ring that feeds on the souls of those who wear it."},{"id":179,"name":"recipe_arcane_boots"},{"id":180,"name":"arcane_boots","localized_name":"Arcane Boots","description":"<h1>Active: Replenish Mana</h1>Restores 160 mana to all nearby allies.<br><br>Radius: 1200<br />\r\nMovement speed bonuses from multiple pairs of boots do not stack.","notes":"Does not work on Meepo clones.","lore":"Magi equipped with these boots are valued in battle."},{"id":181,"name":"orb_of_venom","localized_name":"Orb of Venom","description":"<h1>Passive: Poison Attack</h1>Poisons the target, dealing 5 magical damage per second and slowing movement by 12% if the equipped hero is melee, or 3 magical damage per second and slowing movement by 4% if they are ranged. Lasts for 3 seconds.","lore":"Envenoms your veapon with the venom of a venomous viper."},{"id":184,"name":"recipe_ancient_janggo"},{"id":185,"name":"ancient_janggo","localized_name":"Drum of Endurance","description":"<h1>Active: Endurance</h1> Gives +35 attack speed and +13% movement speed to nearby allies for 6 seconds. <br><br>Radius: 1200","notes":"Re-purchasing the Drum of Endurance recipe will refresh its charges.<br />Multiple instances of Swiftness Aura do not stack.","lore":"A relic that enchants the bodies of those around it for swifter movement in times of crisis."},{"id":186,"name":"recipe_medallion_of_courage"},{"id":187,"name":"medallion_of_courage","localized_name":"Medallion of Courage","description":"<h1>Active: Valor</h1> If cast on an ally, grants them the 7 armor, and removing it from the caster. <br><br>If cast on an enemy, reduces 7 armor on both the enemy and the caster. <br><br>Cannot target magic immune enemies.<br><br>Range: 1000","lore":"The bearer has no fear of combat."},{"id":188,"name":"smoke_of_deceit","localized_name":"Smoke of Deceit","description":"<h1>Use: Disguise</h1> Turns the caster and all allied player-controlled units in a 1200 radius invisible, and grants 15% bonus movement speed for 35 seconds. <br><br>Attacking, or moving within 1025 range of an enemy hero or tower, will break the invisibility. <br><br>Disguise grants invisibility that is immune to True Sight.","lore":"The charlatan wizard Myrddin's only true contribution to the arcane arts."},{"id":189,"name":"recipe_veil_of_discord"},{"id":190,"name":"veil_of_discord","localized_name":"Veil of Discord","description":"<h1>Active: Magic Weakness</h1> Cast a 600 radius blast that decreases enemy magic resistance by 25%.<br><br>Range: 1000<br>Duration: 16 seconds.","lore":"The headwear of corrupt magi."},{"id":205,"name":"recipe_rod_of_atos"},{"id":206,"name":"rod_of_atos","localized_name":"Rod of Atos","description":"<h1>Active: Cripple</h1>Roots the target for 2 seconds.<br><br>Range: 1100","lore":"Atos, the Lord of Blight, has his essence stored in this deceptively simple wand."},{"id":207,"name":"recipe_abyssal_blade"},{"id":208,"name":"abyssal_blade","localized_name":"Abyssal Blade","description":"<h1>Active: Overwhelm</h1> Stuns a target enemy unit for 2 seconds. <br><br>Pierces Spell Immunity.<br><br>Range: 140<br />\r\n<h1>Passive: Bash</h1> Grants melee heroes a 25% chance on hit to stun the target for 1.5 seconds and deal 100 bonus magical damage.  Bash chance for ranged heroes is 10%.<br />\r\n<h1>Passive: Damage Block</h1> Grants a 50% chance to block 70 damage from incoming attacks on melee heroes, and 35 damage on ranged.","notes":"The stun is melee range.<br />Does not stack with other bashes.<br />The following heroes cannot trigger Bash on this item: Spirit Breaker, Faceless Void, Slardar, and Troll Warlord.<br />Multiple sources of damage block do not stack.","lore":"The lost blade of the Commander of the Abyss, this edge cuts into an enemy's soul."},{"id":209,"name":"recipe_heavens_halberd"},{"id":210,"name":"heavens_halberd","localized_name":"Heaven's Halberd","description":"<h1>Active: Disarm</h1>Prevents a target from attacking for 3 seconds on melee targets, and 5 seconds on ranged targets.<br><br>Range: 600","lore":"This halberd moves with the speed of a smaller weapon, allowing the bearer to win duels that a heavy edge would not."},{"id":211,"name":"recipe_ring_of_aquila"},{"id":212,"name":"ring_of_aquila"},{"id":213,"name":"recipe_tranquil_boots"},{"id":214,"name":"tranquil_boots","localized_name":"Tranquil Boots","description":"<h1>Passive: Break</h1> Whenever you attack a hero or are attacked by any unit, the bonus 16 HP regen is lost and the movement speed bonus is reduced to 18% for 13 seconds.<br />\r\nMovement speed bonuses from multiple pairs of boots do not stack.","lore":"While they increase the longevity of the wearer, this boot is not particularly reliable."},{"id":215,"name":"shadow_amulet","localized_name":"Shadow Amulet","description":"<h1>Active: Fade</h1>Grants invisibility to you or a target allied hero as long as the target unit remains still.  <br><br>Has a 1.25 second fade time, and breaks instantly upon moving. <br><br>There is no cooldown when using this item on yourself.<br><br>Range: 600","lore":"A small talisman that clouds the senses of one's enemies when held perfectly still."},{"id":216,"name":"enchanted_mango","localized_name":"Enchanted Mango","description":"<h1>Use: Eat Mango</h1> Instantly restores 125 mana.<br><br>Range: 400","notes":"Hold Control to use on a nearby allied hero.","lore":"The bittersweet flavors of Jidi Isle are irresistible to amphibians."},{"id":218,"name":"ward_dispenser"},{"id":220,"name":"travel_boots_2"},{"id":226,"name":"lotus_orb","localized_name":"Lotus Orb","description":"<h1>Active: Echo Shell</h1>Applies a shield to the target unit for 6 seconds which re-casts most targeted spells back to their caster.<br><br>The shielded unit will still take damage from the spell. <br><br>Range: 900<br>Dispel Type: <span class=\"GameplayValues GameplayVariable\">Basic Dispel</span>","lore":"The jewel at its center still reflects a pale image of its creator."},{"id":229,"name":"solar_crest","localized_name":"Solar Crest","description":"<h1>Active: Shine</h1>When cast on an ally, grants them 12 armor, 80 attack speed, and 10% movement speed. When cast on an enemy, removes 12 armor, 80 attack speed, and 10% movement speed.<br><br>Removes the armor from the caster when used. <br><br> Cannot target magic immune enemies.<br><br>Range: 1000","lore":"A talisman forged to honor the daytime sky."},{"id":231,"name":"guardian_greaves","localized_name":"Guardian Greaves","description":"<h1>Active: Mend</h1>Restores 300 health and 200 mana to nearby allies, and removes most negative effects from the caster.<br><br>Radius: 1200<br>Dispel Type: <span class=\"GameplayValues GameplayVariable\">Basic Dispel</span><br />\r\n<h1>Passive: Guardian Aura</h1> Provides nearby allies with 3.5 health regeneration and 2 bonus armor. If an allied hero's health falls below 20%, they receive 16 health regeneration and 10 armor.<br />\r\nMovement speed bonuses from multiple pairs of boots do not stack.","notes":"The aura boost only applies to heroes.","lore":"One of many holy instruments constructed to honor the Omniscience."},{"id":235,"name":"octarine_core","localized_name":"Octarine Core","description":"<h1>Passive: Cooldown Reduction</h1>Reduces the cooldown time of all spells and items by 25%.<br />\r\n<h1>Passive: Spell Lifesteal</h1>25% of spell damage dealt to enemy heroes is returned to the caster as health, regardless of spell damage type.  <br><br>Lifesteal reduced to 5% against creeps.","lore":"At the core of spellcraft are spectrums only the very gifted can sense."},{"id":247,"name":"moon_shard","localized_name":"Moon Shard","description":"<h1>Use: Consume</h1> Consume the Moon Shard to permanently gain 60 attack speed and 200 bonus night vision. Max 1 use.<br />\r\n<h1>Passive: Shade Sight</h1>Grants 400 bonus night vision.","notes":"The bonus night vision works during Night Stalker's Darkness ability.","lore":"Said to be a tear from the lunar goddess Selemene."},{"id":249,"name":"silver_edge","localized_name":"Silver Edge","description":"<h1>Active: Shadow Walk</h1>Makes you invisible for 14 seconds, or until you attack or cast a spell.  While invisible, you move 25% faster and can move through units.  <br><br>Attacking to end the invisibility will deal 175 bonus physical damage to the target, and for 4 seconds, disable their passive abilities.","notes":"Backstab cannot miss.<br />Backstab does not pierce spell immunity.","lore":"Once used to slay an unjust king, only to have the kingdom erupt into civil war in the aftermath."},{"id":254,"name":"glimmer_cape","localized_name":"Glimmer Cape","description":"<h1>Active: Glimmer</h1> After a 0.6 second delay, grants invisibility and 45% magic resistance to you or a target allied unit for 5 seconds.<br><br>Range: 800<br><br>Can be cast while channelling.","lore":"The stolen cape of a master illusionist."},{"id":1000,"name":"halloween_candy_corn"},{"id":1001,"name":"mystery_hook"},{"id":1002,"name":"mystery_arrow"},{"id":1003,"name":"mystery_missile"},{"id":1004,"name":"mystery_toss"},{"id":1005,"name":"mystery_vacuum"},{"id":1006,"name":"halloween_rapier"},{"id":1007,"name":"greevil_whistle"},{"id":1008,"name":"greevil_whistle_toggle"},{"id":1009,"name":"present"},{"id":1010,"name":"winter_stocking"},{"id":1011,"name":"winter_skates"},{"id":1012,"name":"winter_cake"},{"id":1013,"name":"winter_cookie"},{"id":1014,"name":"winter_coco"},{"id":1015,"name":"winter_ham"},{"id":1016,"name":"winter_kringle"},{"id":1017,"name":"winter_mushroom"},{"id":1018,"name":"winter_greevil_treat"},{"id":1019,"name":"winter_greevil_garbage"},{"id":1020,"name":"winter_greevil_chewy"},{"id":241,"name":"tango_single"},{"id":242,"name":"crimson_guard","localized_name":"Crimson Guard","description":"<h1>Active: Guard</h1> For 12 seconds, grant nearby allied heroes and buildings +2 armor, and a 100% chance to block 60 damage from each incoming attack.<br><br>Units may only be affected by Guard once every 46 seconds.<br><br>Radius: 1200<br />\r\n<h1>Passive: Damage Block</h1> Grants a 50% chance to block 70 damage from incoming attacks on melee heroes, and 35 damage on ranged.","notes":"Multiple sources of damage block do not stack.","lore":"A cuirass originally built to protect against the dreaded Year Beast."},{"id":238,"name":"recipe_iron_talon"},{"id":239,"name":"iron_talon"},{"id":233,"name":"recipe_aether_lens"},{"id":232,"name":"aether_lens","localized_name":"Aether Lens","description":"<h1>Passive: Aethereal Focus</h1> Increases targeted spell and item cast range by 250.","notes":"Passive does not stack.","lore":"Polished with the incantation of his final breath, the gift of a dying mage to his sickly son."},{"id":234,"name":"recipe_dragon_lance"},{"id":236,"name":"dragon_lance","localized_name":"Dragon Lance","description":"<h1>Passive: Dragon's Reach</h1> Increases attack range of ranged heroes by 140.","notes":"Passive does not stack.","lore":"The forward charge of the wyvern host grants no quarter."},{"id":237,"name":"faerie_fire","localized_name":"Faerie Fire","description":"<h1>Use: Imbue</h1> Instantly restores 85 health.","lore":"The ethereal flames from the ever-burning ruins of Kindertree ignite across realities."},{"id":244,"name":"wind_lace","localized_name":"Wind Lace","description":"Bonuses from multiple Wind Laces do not stack.","lore":"Hasten to battle on wind-touched heels."},{"id":245,"name":"recipe_bloodthorn"},{"id":250,"name":"bloodthorn","localized_name":"Bloodthorn","description":"<h1>Active: Soul Rend</h1> Silences a target for 5 seconds. At the end of the silence, an additional 30% of all damage taken during the silence will be dealt to the target as magical damage.<br><br>All attacks on the silenced target will have True Strike and 100% chance to crit for 140% damage.<br><br>Range: 900<br />\r\n<h1>Passive: Critical Strike</h1> Grants a 20% chance for attacks to inflict 175% damage.","notes":"Critical Strike does not work against buildings.","lore":"A reviled blade that bites deeper with each wriggle of its victim's final throes."},{"id":251,"name":"recipe_echo_sabre"},{"id":252,"name":"echo_sabre","localized_name":"Echo Sabre","description":"<h1>Passive: Echo Strike</h1> Causes melee attacks to attack twice in quick succession. The double attacks apply a 100% movement slow for 0.8 seconds on each strike.","lore":"A deceptively swift blade imbued with resonant magic."},{"id":257,"name":"tome_of_knowledge","localized_name":"Tome of Knowledge","description":"<h1>Use: Enlighten</h1>Grants you 700 experience plus 135 per tome consumed by your team.<br><br>Tomes Used By Team: %customval_team_tomes_used%","lore":"That which raises beast to man and man to god."},{"id":262,"name":"recipe_hurricane_pike"},{"id":263,"name":"hurricane_pike","localized_name":"Hurricane Pike","description":"<h1>Active: Hurricane Thrust</h1> Pushes you and target enemy 450 units away from each other, and for 5 seconds, allows you to make 4 attacks against the target without range restrictions and with +100 attack speed.<br><br>Works like Force Staff when used on self or allies.<br><br>Allied Range: 800<br>Enemy Range: 400<br />\r\n<h1>Passive:  Dragon's Reach</h1> Increases attack range of ranged heroes by 140.","notes":"Self-cast will use Hurricane Pike on yourself.<br />Hurricane Pike doesn't interrupt the target's actions.<br />Will not work on a unit inside Chronosphere, Duel, or Black Hole.","lore":"A legendary pike once held as royal sigil of the ancient wyvern riders."},{"id":240,"name":"blight_stone","localized_name":"Blight Stone","description":"<h1>Passive: Lesser Corruption</h1> Your attacks reduce the target's armor by 2 for 8 seconds.","lore":"An unnerving stone unearthed beneath the Fields of Endless Carnage."},{"id":265,"name":"infused_raindrop","localized_name":"Infused Raindrops","description":"<h1>Passive: Magical Damage Block</h1> Consumes a charge to block 120 magic damage from damage instances over 50 damage. <br><br>Comes with 5 charges. When the charges are gone, the item disappears.","notes":"Uses at most one charge per damage instance.","lore":"Elemental protection from magical assaults."}]}